SOURCE/newsource/backend/controllers/CastingController.php

SELECT * FROM `casting` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Casting::findOne($id)) !== null) {