SOURCE/newsource/frontend/models/Movie.php

SELECT * FROM `movie` WHERE (`status`=1) AND (`hot`=1)
---
    public static function getNormal($arrHot){
        $query = Movie::find()->where(['status'=>1,'hot'=>0])
                ->andWhere(['not in','id',$arrHot])->all();

SELECT * FROM `casting` WHERE `movie_id`='1'
SELECT * FROM `register` WHERE `casting_id`='1'
---
    function getJoin(){
        $casting = Casting::find()->where(['movie_id'=>$this->id])->asArray()->all();
        $arrCatid = array();
        foreach($casting as $cas){
            $arrCatid[] = $cas['id'];
        }
        if(count($arrCatid) > 0){
            $register = Register::find()->where(['casting_id'=>$arrCatid])->asArray()->all();