SOURCE/newsource/frontend/models/News.php

SELECT * FROM `news` WHERE (`status`=1) AND (`id`<>'2') ORDER BY `created_time` DESC
---
    public static function getMoreNews($removeid) {
        $query = News::find()
                ->where(['status' => 1])
                ->andWhere(['not in', 'id', $removeid])
                ->orderBy('created_time desc');
        return $query->all();