SOURCE/newsource/frontend/models/Topic.php

SELECT * FROM `topic` WHERE `is_active`=1 ORDER BY `priority`, `updated_at` DESC LIMIT 7
---
  public static function getListHot($limit = 12, $offset = 0)
  {
      $cache = \Yii::$app->cache;
      $key = 'Topic_getListHotMusicGenre_'.$limit.$offset;
      $data = $cache->get($key);
      if (!$data) {
          $data = Topic::find()
              ->where([
                  'is_active' => Constant::ACTIVE
              ])
              ->orderBy('priority, updated_at desc')
              ->limit($limit)
              ->offset($offset)