SOURCE/newsource/frontend/models/VtSong.php

    public static function getListRankSong($id)
    {
        $limit = \Yii::$app->params['number_rank_song'];
        $cache = \Yii::$app->cache;
        $key = 'VtSong_getListRankSong_' . $id;
        $data = $cache->get($key);
        if (!$data) {
            $data = VtSong::find()
                ->select('vt_song.*, rank_song.position, rank_song.image_path   ')
                ->leftJoin('rank_song', 'vt_song.id = rank_song.song_id')
                ->where([
                    'rank_song.rank_id' => $id,
                    'vt_song.is_active' => Constant::ACTIVE
                ])->with(['singers' => function ($query) {
                    $query->andWhere('is_active = :active', [':active' => Constant::ACTIVE]);
                }])
                ->orderBy('rank_song.position asc')
                ->limit($limit)
                ->asArray()
                ->all();
---
SELECT `vt_song`.*, `rank_song`.`position`, `rank_song`.`image_path` FROM `vt_song` LEFT JOIN `rank_song` ON vt_song.id = rank_song.song_id WHERE (`rank_song`.`rank_id`=2) AND (`vt_song`.`is_active`=1) ORDER BY `rank_song`.`position` LIMIT 10

    public static function getListSongHotByGenreId($genreId, $limit = 20, $offset = 0, $songid = 0)
    {
        $cache = \Yii::$app->cache;
        $key = 'VtSong_getListSongHotByGenreId_' . $genreId . $offset . $limit;
        $data = $cache->get($key);
        if (!$data) {
            $data = VtSong::find()
                ->select('*')
                ->leftJoin(VtMusicGenreJoin::tableName(), VtMusicGenreJoin::tableName() . '.song_id=' . VtSong::tableName() . '.id')
                ->where([
                    VtSong::tableName() . '.is_active' => Constant::ACTIVE,
                    VtMusicGenreJoin::tableName() . '.music_genre_id' => $genreId
                ])
                    ->andWhere(['<>','id',$songid])
---
SELECT * FROM `vt_song` LEFT JOIN `vt_music_genre_join` ON vt_music_genre_join.song_id=vt_song.id WHERE ((`vt_song`.`is_active`=1) AND (`vt_music_genre_join`.`music_genre_id`=5)) AND (`id` <> 0) ORDER BY `vt_music_genre_join`.`updated_at` DESC LIMIT 12