SOURCE/newsource/frontend/models/VtVideo.php

    public static function getListRankVideo($id)
    {
        $cache = \Yii::$app->cache;
        $key = 'VtVideo_getListRankVideo_' . $id;
        $data = $cache->get($key);
        if (!$data) {
            $limit = \Yii::$app->params['number_rank_video'];
            $data = VtVideo::find()
                ->leftJoin('rank_video', 'vt_video.id = rank_video.video_id')
                ->where([
                    'rank_video.rank_id' => $id,
                    'vt_video.is_active' => Constant::ACTIVE,
                ])
                ->with(['singers' => function ($query) {
                    $query->andWhere('is_active = :active', [':active' => Constant::ACTIVE]);
                }])
                ->orderBy('rank_video.position asc')
                ->limit($limit)
                ->all();
---
SELECT `vt_video`.* FROM `vt_video` LEFT JOIN `rank_video` ON vt_video.id = rank_video.video_id WHERE (`rank_video`.`rank_id`=19) AND (`vt_video`.`is_active`=1) ORDER BY `rank_video`.`position` LIMIT 10