SOURCE/newsource/backend/views/casting/index.php

                                'attribute' => 'movie_id',
                                'format' => 'raw', //raw, html
                                'content' => function($dataProvider) {
                                $m =  Movie::find()->where($dataProvider['movie_id'])->one();//->name;
---
SELECT * FROM `movie` WHERE `id`='1'