SOURCE/newsource/backend/models/Casting.php

SELECT * FROM `movie`
---
     public function getAllMovie() {
        $query = Movie::find()->all();