RELEASE/frontend/models/Movie.php

    public static function getHot() {
        $query = Movie::find()->where(['status' => 1, 'hot' => 1]);
        return $query->all();
---
SELECT * FROM `movie` WHERE (`status`=1) AND (`hot`=1)

    public static function getNormal($arrHot, $limit = 6) {
        $query = Movie::find()->where(['status' => 1, 'hot' => 0])
                        ->andWhere(['not in', 'id', $arrHot])->orderBy('id desc')->limit($limit)->all();
---
SELECT * FROM `movie` WHERE ((`status`=1) AND (`hot`=0)) AND (`id` NOT IN (1, 2)) ORDER BY `id` DESC LIMIT 6

    function getJoin() {
        $casting = Casting::find()->where(['movie_id' => $this->id])->asArray()->all();
        $arrCatid = array();
        foreach ($casting as $cas) {
            $arrCatid[] = $cas['id'];
        }
        if (count($arrCatid) > 0) {
            $register = Register::find()->where(['casting_id' => $arrCatid])->asArray()->all();
---
SELECT * FROM `casting` WHERE `movie_id`=1
SELECT * FROM `register` WHERE `casting_id` IN ('1', '3')