SOURCE/newsource/frontend/controllers/MovieController.php

SELECT * FROM `movie` WHERE `id`='1'
SELECT * FROM `casting` WHERE (`movie_id`='1') AND (`status`=1)
---
    public function actionIndex() {
        $id = Yii::$app->getRequest()->getQueryParam('id');
        $limit = Yii::$app->params['page_movie'];
        $movie = Movie::findOne($id);
        $casting = Casting::find()->where(['movie_id' => $id, 'status' => 1])->all();