SOURCE/newsource/frontend/controllers/NewsController.php

    public function actionIndex() {
        $limit = Yii::$app->params['page_movie'];
        $hot = News::find()->where(['status' => 1])->orderBy('created_time desc')->one();
        $page = 0;
        $others = News::find()
                ->where(['status' => 1])
//                    ->andWhere(['not in', 'id', $hot->id])
                ->orderBy('created_time desc');
//                    ->limit($limit)
//                    ->all();
        if ($hot) {
            $others->andWhere(['not in', 'id', $hot->id]);
        }
        $all = $others->all();
---
SELECT * FROM `news` WHERE `status`=1 ORDER BY `created_time` DESC
SELECT * FROM `news` WHERE (`status`=1) AND (`id`<>'4') ORDER BY `created_time` DESC LIMIT 1

    public function actionDetail() {
        $id = Yii::$app->getRequest()->getQueryParam('id');
        $news = News::find()->where(['id' => $id, 'status' => 1])->one();
---
SELECT * FROM `news` WHERE (`id` != '1') AND (`status`=1)