SOURCE/newsource/frontend/controllers/RegisterController.php

SELECT * FROM `casting` WHERE (`status`=1) AND (`id`='1')
---
    public function actionIndex() {
//        $form = new RegisterForm();
        $movieid = Yii::$app->getRequest()->getQueryParam('slug');
        $id = Yii::$app->getRequest()->getQueryParam('id');
        $casting = Casting::find()->where(['status' => 1, 'id' => $id])->one();