RELEASE/frontend/controllers/NewsController.php

SELECT * FROM `news` WHERE (`id`='2') AND (`status`=1)
SELECT * FROM `news` WHERE (`id` != '2') AND (`status`=1)
---
    public function actionDetail() {
        $id = Yii::$app->getRequest()->getQueryParam('id');
        $news = News::find()->where(['id' => $id, 'status' => 1])->one();
        $other = News::find()
                ->where(['!=', 'id', $id])
                ->andWhere(['status' => 1])
                ->all();